In [2]:
import pandas as pd

In [7]:
# Series: One dimensional array like object that can hold any data type
# It is similar to column in a table 
data = [1, 2, 3, 4, 5]
series = pd.Series(data)
print("Series: \n", series)

Series:
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
# Series using Dictionary
data = {"a" : 1, "b" : 2, "c" : 3}
series = pd.Series(data)
print(series)

a    1
b    2
c    3
dtype: int64

In [8]:
# Dataframe: 2-dimensional type object
# Similar to a table having rows and columns

data = {
    "Name": ["Ben", "Anna", "Peven"],
    "Age": [18, 19, 18],
    "City": ["Punjab", "Bengaluru", "Chennai"]
}
df = pd.DataFrame(data)
print(df)

    Name  Age       City
0    Ben   18     Punjab
1   Anna   19  Bengaluru
2  Peven   18    Chennai

In [11]:
df.iloc[0:2]

   Name  Age       City
0   Ben   18     Punjab
1  Anna   19  Bengaluru

In [15]:
df['Salary'] = [80000, 72000, 61000]
df

    Name  Age       City  Salary
0    Ben   18     Punjab   80000
1   Anna   19  Bengaluru   72000
2  Peven   18    Chennai   61000

In [19]:
# Removing a column
# Use inplace = True to permanently complete an operation
df.drop('Salary', axis = 1, inplace = True)
df

    Name  Age       City
0    Ben   18     Punjab
1   Anna   19  Bengaluru
2  Peven   18    Chennai